{"class_name": "Model", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 256, 256, 3]}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "front_conv_1x1_x1", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [7, 7], "dilation_rate": [1, 1], "name": "front_conv_1x1_x1", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [2, 2], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_1", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["front_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "front_residual_x1_conv_1x1_x1", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "front_residual_x1_conv_1x1_x1", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 32}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_2", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["front_residual_x1_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "front_residual_x1_conv_3x3_x2", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "front_residual_x1_conv_3x3_x2", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 32}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_3", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["front_residual_x1_conv_3x3_x2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "front_residual_x1_conv_1x1_x3", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "front_residual_x1_conv_1x1_x3", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_4", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["front_residual_x1_conv_1x1_x3", 0, 0, {}]]]}, {"class_name": "Add", "name": "front_residual_x1_residual", "config": {"name": "front_residual_x1_residual", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}], ["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "valid", "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["front_residual_x1_residual", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "front_residual_x2_conv_1x1_x1", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "front_residual_x2_conv_1x1_x1", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 32}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_5", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["front_residual_x2_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "front_residual_x2_conv_3x3_x2", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "front_residual_x2_conv_3x3_x2", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 32}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_6", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["front_residual_x2_conv_3x3_x2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "front_residual_x2_conv_1x1_x3", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "front_residual_x2_conv_1x1_x3", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_7", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["front_residual_x2_conv_1x1_x3", 0, 0, {}]]]}, {"class_name": "Add", "name": "front_residual_x2_residual", "config": {"name": "front_residual_x2_residual", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "front_residual_x3_conv_1x1_x1", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "front_residual_x3_conv_1x1_x1", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["front_residual_x2_residual", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_8", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["front_residual_x3_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "front_residual_x3_conv_3x3_x2", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "front_residual_x3_conv_3x3_x2", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_9", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["front_residual_x3_conv_3x3_x2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "front_residual_x3_conv_1x1_x3", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "front_residual_x3_conv_1x1_x3", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 128}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "front_residual_x3skip", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "front_residual_x3skip", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 128}, "inbound_nodes": [[["front_residual_x2_residual", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_10", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["front_residual_x3_conv_1x1_x3", 0, 0, {}]]]}, {"class_name": "Add", "name": "front_residual_x3_residual", "config": {"name": "front_residual_x3_residual", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["front_residual_x3skip", 0, 0, {}], ["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l1_conv_1x1_x1", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "hg0_l1_conv_1x1_x1", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["front_residual_x3_residual", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_11", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["hg0_l1_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l1_conv_3x3_x2", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "hg0_l1_conv_3x3_x2", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_12", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["hg0_l1_conv_3x3_x2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l1_conv_1x1_x3", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "hg0_l1_conv_1x1_x3", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 128}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_13", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["hg0_l1_conv_1x1_x3", 0, 0, {}]]]}, {"class_name": "Add", "name": "hg0_l1_residual", "config": {"name": "hg0_l1_residual", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["front_residual_x3_residual", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "valid", "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["hg0_l1_residual", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l2_conv_1x1_x1", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "hg0_l2_conv_1x1_x1", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_14", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["hg0_l2_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l2_conv_3x3_x2", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "hg0_l2_conv_3x3_x2", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_15", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["hg0_l2_conv_3x3_x2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l2_conv_1x1_x3", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "hg0_l2_conv_1x1_x3", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 128}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_16", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["hg0_l2_conv_1x1_x3", 0, 0, {}]]]}, {"class_name": "Add", "name": "hg0_l2_residual", "config": {"name": "hg0_l2_residual", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}], ["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"name": "max_pooling2d_3", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "valid", "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["hg0_l2_residual", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l4_conv_1x1_x1", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "hg0_l4_conv_1x1_x1", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_17", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["hg0_l4_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l4_conv_3x3_x2", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "hg0_l4_conv_3x3_x2", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_18", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["hg0_l4_conv_3x3_x2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l4_conv_1x1_x3", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "hg0_l4_conv_1x1_x3", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 128}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_19", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_19", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["hg0_l4_conv_1x1_x3", 0, 0, {}]]]}, {"class_name": "Add", "name": "hg0_l4_residual", "config": {"name": "hg0_l4_residual", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_4", "config": {"name": "max_pooling2d_4", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "valid", "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["hg0_l4_residual", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l8_conv_1x1_x1", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "hg0_l8_conv_1x1_x1", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_20", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_20", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["hg0_l8_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l8_conv_3x3_x2", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "hg0_l8_conv_3x3_x2", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_21", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_21", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["hg0_l8_conv_3x3_x2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l8_conv_1x1_x3", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "hg0_l8_conv_1x1_x3", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 128}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_22", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_22", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["hg0_l8_conv_1x1_x3", 0, 0, {}]]]}, {"class_name": "Add", "name": "hg0_l8_residual", "config": {"name": "hg0_l8_residual", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}], ["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "0_lf8_x1_conv_1x1_x1", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "0_lf8_x1_conv_1x1_x1", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["hg0_l8_residual", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_26", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_26", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["0_lf8_x1_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "0_lf8_x1_conv_3x3_x2", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "0_lf8_x1_conv_3x3_x2", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_27", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_27", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["0_lf8_x1_conv_3x3_x2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "0_lf8_x1_conv_1x1_x3", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "0_lf8_x1_conv_1x1_x3", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 128}, "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_28", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_28", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["0_lf8_x1_conv_1x1_x3", 0, 0, {}]]]}, {"class_name": "Add", "name": "0_lf8_x1_residual", "config": {"name": "0_lf8_x1_residual", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["hg0_l8_residual", 0, 0, {}], ["batch_normalization_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "0_lf8_x2_conv_1x1_x1", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "0_lf8_x2_conv_1x1_x1", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["0_lf8_x1_residual", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_29", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_29", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["0_lf8_x2_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "0_lf8_x2_conv_3x3_x2", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "0_lf8_x2_conv_3x3_x2", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_30", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_30", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["0_lf8_x2_conv_3x3_x2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "0_lf8_x2_conv_1x1_x3", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "0_lf8_x2_conv_1x1_x3", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 128}, "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_31", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_31", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["0_lf8_x2_conv_1x1_x3", 0, 0, {}]]]}, {"class_name": "Add", "name": "0_lf8_x2_residual", "config": {"name": "0_lf8_x2_residual", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["0_lf8_x1_residual", 0, 0, {}], ["batch_normalization_31", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "0_lf8_x3_conv_1x1_x1", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "0_lf8_x3_conv_1x1_x1", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["0_lf8_x2_residual", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "0_lf8_conv_1x1_x1", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "0_lf8_conv_1x1_x1", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["hg0_l8_residual", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_32", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_32", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["0_lf8_x3_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_23", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_23", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["0_lf8_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_rf4_connect_conv_1x1_x1", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "name": "hg0_rf4_connect_conv_1x1_x1", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["hg0_l4_residual", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "0_lf8_x3_conv_3x3_x2", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "0_lf8_x3_conv_3x3_x2", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "0_lf8_conv_3x3_x2", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "0_lf8_conv_3x3_x2", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_35", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_35", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["hg0_rf4_connect_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_33", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_33", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["0_lf8_x3_conv_3x3_x2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_24", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "name": "batch_normalization_24", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["0_lf8_conv_3x3_x2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_rf4_connect_conv_3x3_x2", "config": {"activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "hg0_rf4_connect_conv_3x3_x2", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "activation": "relu", "filters": 64}, "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "0_lf8_x3_conv_1x1_x3", "config": {"activity_regularizer": null, "kernel_constraint": null,