{"keras_version": "2.3.1", "class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 256, 256, 3], "name": "input_1", "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "front_conv_1x1_x1", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [2, 2], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [7, 7], "dtype": "float32", "name": "front_conv_1x1_x1", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_1", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["front_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "front_residual_x1_conv_1x1_x1", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 32, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "name": "front_residual_x1_conv_1x1_x1", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_2", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["front_residual_x1_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "front_residual_x1_conv_3x3_x2", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 32, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "name": "front_residual_x1_conv_3x3_x2", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_3", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["front_residual_x1_conv_3x3_x2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "front_residual_x1_conv_1x1_x3", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "name": "front_residual_x1_conv_1x1_x3", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_4", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["front_residual_x1_conv_1x1_x3", 0, 0, {}]]]}, {"class_name": "Add", "name": "front_residual_x1_residual", "config": {"trainable": true, "dtype": "float32", "name": "front_residual_x1_residual"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}], ["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "dtype": "float32", "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["front_residual_x1_residual", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "front_residual_x2_conv_1x1_x1", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 32, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "name": "front_residual_x2_conv_1x1_x1", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_5", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["front_residual_x2_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "front_residual_x2_conv_3x3_x2", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 32, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "name": "front_residual_x2_conv_3x3_x2", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_6", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["front_residual_x2_conv_3x3_x2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "front_residual_x2_conv_1x1_x3", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "name": "front_residual_x2_conv_1x1_x3", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_7", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["front_residual_x2_conv_1x1_x3", 0, 0, {}]]]}, {"class_name": "Add", "name": "front_residual_x2_residual", "config": {"trainable": true, "dtype": "float32", "name": "front_residual_x2_residual"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "front_residual_x3_conv_1x1_x1", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "name": "front_residual_x3_conv_1x1_x1", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["front_residual_x2_residual", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_8", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["front_residual_x3_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "front_residual_x3_conv_3x3_x2", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "name": "front_residual_x3_conv_3x3_x2", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_9", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["front_residual_x3_conv_3x3_x2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "front_residual_x3_conv_1x1_x3", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 128, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "name": "front_residual_x3_conv_1x1_x3", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "front_residual_x3skip", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 128, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "name": "front_residual_x3skip", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["front_residual_x2_residual", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_10", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["front_residual_x3_conv_1x1_x3", 0, 0, {}]]]}, {"class_name": "Add", "name": "front_residual_x3_residual", "config": {"trainable": true, "dtype": "float32", "name": "front_residual_x3_residual"}, "inbound_nodes": [[["front_residual_x3skip", 0, 0, {}], ["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l1_conv_1x1_x1", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "name": "hg0_l1_conv_1x1_x1", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["front_residual_x3_residual", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_11", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["hg0_l1_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l1_conv_3x3_x2", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "name": "hg0_l1_conv_3x3_x2", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_12", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["hg0_l1_conv_3x3_x2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l1_conv_1x1_x3", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 128, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "name": "hg0_l1_conv_1x1_x3", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_13", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["hg0_l1_conv_1x1_x3", 0, 0, {}]]]}, {"class_name": "Add", "name": "hg0_l1_residual", "config": {"trainable": true, "dtype": "float32", "name": "hg0_l1_residual"}, "inbound_nodes": [[["front_residual_x3_residual", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "dtype": "float32", "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["hg0_l1_residual", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l2_conv_1x1_x1", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "name": "hg0_l2_conv_1x1_x1", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_14", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["hg0_l2_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l2_conv_3x3_x2", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "name": "hg0_l2_conv_3x3_x2", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_15", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["hg0_l2_conv_3x3_x2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l2_conv_1x1_x3", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 128, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "name": "hg0_l2_conv_1x1_x3", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_16", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["hg0_l2_conv_1x1_x3", 0, 0, {}]]]}, {"class_name": "Add", "name": "hg0_l2_residual", "config": {"trainable": true, "dtype": "float32", "name": "hg0_l2_residual"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}], ["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "dtype": "float32", "name": "max_pooling2d_3", "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["hg0_l2_residual", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l4_conv_1x1_x1", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "name": "hg0_l4_conv_1x1_x1", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_17", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["hg0_l4_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l4_conv_3x3_x2", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "name": "hg0_l4_conv_3x3_x2", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_18", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["hg0_l4_conv_3x3_x2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l4_conv_1x1_x3", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 128, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "name": "hg0_l4_conv_1x1_x3", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_19", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_19", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["hg0_l4_conv_1x1_x3", 0, 0, {}]]]}, {"class_name": "Add", "name": "hg0_l4_residual", "config": {"trainable": true, "dtype": "float32", "name": "hg0_l4_residual"}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_4", "config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "dtype": "float32", "name": "max_pooling2d_4", "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["hg0_l4_residual", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l8_conv_1x1_x1", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "name": "hg0_l8_conv_1x1_x1", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_20", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_20", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["hg0_l8_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l8_conv_3x3_x2", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "name": "hg0_l8_conv_3x3_x2", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_21", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_21", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["hg0_l8_conv_3x3_x2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_l8_conv_1x1_x3", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 128, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "name": "hg0_l8_conv_1x1_x3", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_22", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_22", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["hg0_l8_conv_1x1_x3", 0, 0, {}]]]}, {"class_name": "Add", "name": "hg0_l8_residual", "config": {"trainable": true, "dtype": "float32", "name": "hg0_l8_residual"}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}], ["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "0_lf8_x1_conv_1x1_x1", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "name": "0_lf8_x1_conv_1x1_x1", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["hg0_l8_residual", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_26", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_26", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["0_lf8_x1_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "0_lf8_x1_conv_3x3_x2", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "name": "0_lf8_x1_conv_3x3_x2", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_27", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_27", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["0_lf8_x1_conv_3x3_x2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "0_lf8_x1_conv_1x1_x3", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 128, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "name": "0_lf8_x1_conv_1x1_x3", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_28", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_28", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["0_lf8_x1_conv_1x1_x3", 0, 0, {}]]]}, {"class_name": "Add", "name": "0_lf8_x1_residual", "config": {"trainable": true, "dtype": "float32", "name": "0_lf8_x1_residual"}, "inbound_nodes": [[["hg0_l8_residual", 0, 0, {}], ["batch_normalization_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "0_lf8_x2_conv_1x1_x1", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "name": "0_lf8_x2_conv_1x1_x1", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["0_lf8_x1_residual", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_29", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_29", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["0_lf8_x2_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "0_lf8_x2_conv_3x3_x2", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "name": "0_lf8_x2_conv_3x3_x2", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_30", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_30", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["0_lf8_x2_conv_3x3_x2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "0_lf8_x2_conv_1x1_x3", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 128, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "name": "0_lf8_x2_conv_1x1_x3", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_31", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_31", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["0_lf8_x2_conv_1x1_x3", 0, 0, {}]]]}, {"class_name": "Add", "name": "0_lf8_x2_residual", "config": {"trainable": true, "dtype": "float32", "name": "0_lf8_x2_residual"}, "inbound_nodes": [[["0_lf8_x1_residual", 0, 0, {}], ["batch_normalization_31", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "0_lf8_x3_conv_1x1_x1", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "name": "0_lf8_x3_conv_1x1_x1", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["0_lf8_x2_residual", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "0_lf8_conv_1x1_x1", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "name": "0_lf8_conv_1x1_x1", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["hg0_l8_residual", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_32", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_32", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["0_lf8_x3_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_23", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_23", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["0_lf8_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_rf4_connect_conv_1x1_x1", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "name": "hg0_rf4_connect_conv_1x1_x1", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["hg0_l4_residual", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "0_lf8_x3_conv_3x3_x2", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "name": "0_lf8_x3_conv_3x3_x2", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "0_lf8_conv_3x3_x2", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "name": "0_lf8_conv_3x3_x2", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_35", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_35", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["hg0_rf4_connect_conv_1x1_x1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_33", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_33", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["0_lf8_x3_conv_3x3_x2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_24", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_24", "beta_constraint": null, "epsilon": 0.001}, "inbound_nodes": [[["0_lf8_conv_3x3_x2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "hg0_rf4_connect_conv_3x3_x2", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "name": "hg0_rf4_connect_conv_3x3_x2", "data_format": "channels_last", "dilation_rate": [1, 1]}, "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "0_lf8_x3_conv_1x1_x3", "config": {"use_bias": true, 